QuangHaiNguyen/Oscilloscope_STM32F746/archive/touchgfx/board/ST/STM324x9I-EVAL-5.7/source/vendor/stm324x9i_eval_ioe8.c
/**
  ******************************************************************************
  * @file    stm324x9i_eval_ioe8.c
  * @author  MCD Application Team
  * @version V1.0.0
  * @date    19-September-2013
  * @brief   This file provides a set of functions needed to manage the STMPE811
  *          IO Expander device mounted on STM324x9I-EVAL evaluation board.
  ******************************************************************************
  * @attention
  *
  * <h2><center>&copy; COPYRIGHT 2013 STMicroelectronics</center></h2>
  *
  * Licensed under MCD-ST Liberty SW License Agreement V2, (the "License");
  * You may not use this file except in compliance with the License.
  * You may obtain a copy of the License at:
  *
  *        http://www.st.com/software_license_agreement_liberty_v2
  *
  * Unless required by applicable law or agreed to in writing, software 
  * distributed under the License is distributed on an "AS IS" BASIS, 
  * WITHOUT WARRANTIES OR CONDITIONS OF ANY KIND, either express or implied.
  * See the License for the specific language governing permissions and
  * limitations under the License.
  *
  ******************************************************************************
  */ 
  
/* File Info : ------------------------------------------------------------------------
                                User NOTES

    - This driver uses the DMA method for sending and receiving data on I2C bus
      which allow higher efficiency and reliability of the communication.  
  
  1. Supported features:
  ----------------------  
      - Touch Screen Features: Single point mode (Polling/Interrupt)

  2. Unsupported features:
  -------------------------  
      - IO Read/write : Set/Reset and Read (Polling/Interrupt)
      - TempSensor Feature: accuracy not determined (Polling).
      - Row ADC Feature is not supported (not implemented on STM324x9I_EVAL board)
      
  3. Known Limitations:
  ---------------------  
      - Limited speed of touch screen in interrupt mode.
      - Touch screen interrupt mode limitation: with exhaustive use of touch screen,  
         the IOE TS is blocked, it will work only after joystick push or reset.

--------------------------------------------------------------------------------------*/

/* Includes ------------------------------------------------------------------*/
#include "stm324x9i_eval_ioe8.h"

/** @addtogroup Utilities
  * @{
  */

/** @addtogroup STM32_EVAL
  * @{
  */ 

/** @addtogroup STM324x9I_EVAL
  * @{
  */
    
/** @defgroup STM324x9I_EVAL_IOE8 
  * @brief  This file includes the IO Expander driver for STMPE811 IO Expander 
  *         devices.
  * @{
  */ 
  

/** @defgroup STM324x9I_EVAL_IOE8_Private_TypesDefinitions
  * @{
  */ 
/**
  * @}
  */ 


/** @defgroup STM324x9I_EVAL_IOE8_Private_Defines
  * @{
  */ 
#define TIMEOUT_MAX    0x3000 /*<! The value of the maximal timeout for I2C waiting loops */
/**
  * @}
  */ 


/** @defgroup STM324x9I_EVAL_IOE8_Private_Macros
  * @{
  */ 
/**
  * @}
  */ 

/** @defgroup STM324x9I_EVAL_IOE8_Private_Variables
  * @{
  */ 
TS_STATE TS_State;              /* The global structure holding the TS state */

uint32_t IOE_TimeOut = TIMEOUT_MAX; /* Value of Timeout when I2C communication fails */
/**
  * @}
  */ 


/** @defgroup STM324x9I_EVAL_IOE8_Private_FunctionPrototypes
  * @{
  */ 
static void     IOE_GPIO_Config(void);
static void     IOE_I2C_Config(void);
static void     IOE_DMA_Config(IOE_DMADirection_TypeDef Direction, uint8_t* buffer);

#ifndef USE_Delay
static void delay(__IO uint32_t nCount);
#endif /* USE_Delay */
/**
  * @}
  */ 


/** @defgroup STM324x9I_EVAL_IOE8_Private_Functions
  * @{
  */ 


/**
  * @brief  Initializes and Configures the IO_Expander Touch Screen Functionality 
  *         and configures all STM324x9I_EVAL necessary
  *         hardware (GPIOs, APB clocks ..).
  * @param  None
  * @retval IOE_OK if all initializations done correctly. Other value if error.
  */
uint8_t IOE_Config(void)
{
  /* Configure the needed pins */
  IOE_GPIO_Config(); 
  
  /* I2C initialization */
  IOE_I2C_Config();
    
  /* Read IO Expander ID  */
  if(IOE_IsOperational())
  {
    return IOE_NOT_OPERATIONAL;
  }
  
  /* Generate IO Expander Software reset */
  IOE_Reset(); 
  
  /* IO Expander configuration */
  /* Touch Screen controller and ADC configuration */
  IOE_FnctCmd(IOE_ADC_FCT, ENABLE);
  IOE_TS_Config();

  /* Configuration is OK */
  return IOE_OK; 
}

/**
  * @brief  Enables the touch screen interrupts.
  * @retval IOE_OK: if all initializations are OK. Other value if error.
  */
uint8_t IOE_TSITConfig(void)
{    
  /* Enable the Global interrupt */  
  IOE_GITCmd(ENABLE);     
          
  /* Enable the Global Interrupts */
  IOE_GITConfig((uint8_t)(IOE_GIT_TOUCH | IOE_GIT_FTH | IOE_GIT_FOV | IOE_GIT_FF | IOE_GIT_FE), ENABLE);    
    
  /* Read the GPIO_IT_STA to clear all pending bits if any */
  I2C_ReadDeviceRegister(IOE_REG_GPIO_INT_STA); 
  
  /* If all OK return IOE_OK */
  return IOE_OK;
}

/**
  * @brief  Returns Status and positions of the Touch screen
  * @param  None
  * @retval Pointer to TS_STATE structure holding Touch Screen information.
  */
TS_STATE* IOE_TS_GetState(void)
{
  static uint32_t _x = 0, _y = 0;
  uint32_t xDiff, yDiff , x , y;
  uint8_t DataXY[3];
  
  /* Check if the Touch detect event happened */
  TS_State.TouchDetected = (I2C_ReadDeviceRegister(IOE_REG_TSC_CTRL) & 0x80);
  
  if(TS_State.TouchDetected) 
  {
    I2C_ReadDataBuffer(IOE_REG_TSC_DATA_XYZ, DataXY, sizeof(DataXY)) ;
    
    x = DataXY[0] << 4;
    x |= (DataXY[1] & 0xF0) >> 4;
    y = (DataXY[ 1] & 0x0F) << 8;
    y |= DataXY[ 2];      
    
    y = (y * LCD_GetPixelHeight()) >> 12;
    y = ((y * LCD_GetPixelHeight()) / 217) - 12;
  
    if(y <= 0)
    {
      y = 0;
    }

    /* first correction */
    x =  (x * LCD_GetPixelWidth()) >> 12;
  
    /* second correction */
    x = ((x * 32)/29) - 17;

    if(x <= 0)
    {
      x = 0;
    }
    
    xDiff = x > _x? (x - _x): (_x - x);
    yDiff = y > _y? (y - _y): (_y - y); 
    
