QuangHaiNguyen/Oscilloscope_STM32F746/archive/touchgfx/board/ST/STM324x9I-EVAL-5.7/source/vendor/stm324x9i_eval_ioe8.c
  /* Test on EV5 and clear it */
  IOE_TimeOut = TIMEOUT_MAX;
  while (!I2C_GetFlagStatus(IOE_I2C, I2C_FLAG_SB))
  {
    if (IOE_TimeOut-- == 0) return(IOE_TimeoutUserCallback());
  }
  
  /* Transmit the slave address and enable writing operation */
  I2C_Send7bitAddress(IOE_I2C, IOE_ADDR, I2C_Direction_Transmitter);
  
  /* Test on EV6 and clear it */
  IOE_TimeOut = TIMEOUT_MAX;  
  while (!I2C_GetFlagStatus(IOE_I2C, I2C_FLAG_ADDR))
  {
    if (IOE_TimeOut-- == 0) return(IOE_TimeoutUserCallback());
  }
  
  /* Read status register 2 to clear ADDR flag */
  IOE_I2C->SR2;
  
  /* Test on EV8 and clear it */
  IOE_TimeOut = TIMEOUT_MAX;
  while (!I2C_GetFlagStatus(IOE_I2C, I2C_FLAG_TXE))
  {
    if (IOE_TimeOut-- == 0) return(IOE_TimeoutUserCallback());
  }
  
  /* Transmit the first address for r/w operations */
  I2C_SendData(IOE_I2C, RegisterAddr);
  
  /* Test on EV8 and clear it */
  IOE_TimeOut = TIMEOUT_MAX;
  while ((!I2C_GetFlagStatus(IOE_I2C, I2C_FLAG_TXE)) || (!I2C_GetFlagStatus(IOE_I2C, I2C_FLAG_BTF)))
  {
    if (IOE_TimeOut-- == 0) return(IOE_TimeoutUserCallback());
  }
  
  /* Regenerate a start condition */
  I2C_GenerateSTART(IOE_I2C, ENABLE);
  
  /* Test on EV5 and clear it */
  IOE_TimeOut = TIMEOUT_MAX;
  while (!I2C_GetFlagStatus(I2C1, I2C_FLAG_SB))
  {
    if (IOE_TimeOut-- == 0) return(IOE_TimeoutUserCallback());
  }
  
  /* Transmit the slave address and enable writing operation */
  I2C_Send7bitAddress(IOE_I2C, IOE_ADDR, I2C_Direction_Receiver);
  
  /* Test on EV6 and clear it */
  IOE_TimeOut = TIMEOUT_MAX;
  while (!I2C_GetFlagStatus(IOE_I2C, I2C_FLAG_ADDR))
  {
    if (IOE_TimeOut-- == 0) return(IOE_TimeoutUserCallback());
  }
  
  /* Disable Acknowledgement */
  I2C_AcknowledgeConfig(IOE_I2C, DISABLE);

  /* Read status register 2 to clear ADDR flag */
  IOE_I2C->SR2;
  
  /* End the configuration sequence */
  I2C_GenerateSTOP(IOE_I2C, ENABLE);
  
  /* Test on EV7 and clear it */
  IOE_TimeOut = TIMEOUT_MAX;
  while (!I2C_GetFlagStatus(IOE_I2C, I2C_FLAG_RXNE))
  {
    if (IOE_TimeOut-- == 0) return(IOE_TimeoutUserCallback());
  }
          
  /* Load the register value */
  tmp = I2C_ReceiveData(IOE_I2C);
  
  /* Enable Acknowledgement to be ready for another reception */
  I2C_AcknowledgeConfig(IOE_I2C, ENABLE);
  
  /* Return the read value */
  return tmp;
  
}

/**
  * @brief  Reads a buffer of 2 bytes from the device registers
  * @param  RegisterAddr: The target register address (between 00x and 0x24)
  * @param  IOE_BufferRX: Data buffer to read  
  * @param  nb_car: number of characters   
  * @retval The data in the buffer containing the two returned bytes (in halfword).   
  */
uint8_t I2C_ReadDataBuffer(uint8_t RegisterAddr, uint8_t *IOE_BufferRX, uint16_t nb_car)
{
        uint32_t index = 0;
        uint32_t IOE_TimeOut;


        /* While the bus is busy */
        IOE_TimeOut = TIMEOUT_MAX;
        
        while(I2C_GetFlagStatus(IOE_I2C, I2C_FLAG_BUSY))
        {
                if((IOE_TimeOut--) == 0) return(IOE_TimeoutUserCallback());
        }

  /* Re-Enable Acknowledgment to be ready for another reception */
        I2C_AcknowledgeConfig(IOE_I2C, ENABLE);
        
        /* Enable the I2C peripheral */
        I2C_GenerateSTART(IOE_I2C, ENABLE);

        /* Test on SB Flag */
        IOE_TimeOut = TIMEOUT_MAX;
        
        while (!I2C_GetFlagStatus(IOE_I2C,I2C_FLAG_SB))
        {
                if (IOE_TimeOut-- == 0) 
    {
      return(IOE_TimeoutUserCallback());
    }
        }

        /* Send device address for write */
        I2C_Send7bitAddress(IOE_I2C, IOE_ADDR, I2C_Direction_Transmitter);

        /* Test on ADDR Flag */
        IOE_TimeOut = TIMEOUT_MAX;
        
        while (!I2C_CheckEvent(IOE_I2C, I2C_EVENT_MASTER_TRANSMITTER_MODE_SELECTED))
        {
                if (IOE_TimeOut-- == 0) 
    {
      return(IOE_TimeoutUserCallback());
    }
        }

        /* Send the device's internal address to write to */
        I2C_SendData(IOE_I2C, RegisterAddr);

        /* Test on TXE FLag (data dent) */
        IOE_TimeOut = TIMEOUT_MAX;

        while ((!I2C_GetFlagStatus(IOE_I2C,I2C_FLAG_TXE)) && (!I2C_GetFlagStatus(IOE_I2C,I2C_FLAG_BTF)))
        {
                if (IOE_TimeOut-- == 0) 
    {
      return(IOE_TimeoutUserCallback());
    }
        }

        /* Send START condition a second time */
        I2C_GenerateSTART(IOE_I2C, ENABLE);

        /* Test on SB Flag */
        IOE_TimeOut = TIMEOUT_MAX;
        
        while (!I2C_GetFlagStatus(IOE_I2C,I2C_FLAG_SB))
        {
                if (IOE_TimeOut-- == 0) 
    {
      return(IOE_TimeoutUserCallback());
    }
        }

        /* Send IOExpander address for read */
        I2C_Send7bitAddress(IOE_I2C, IOE_ADDR, I2C_Direction_Receiver);

        /* Test on ADDR Flag */
        IOE_TimeOut = TIMEOUT_MAX;
        
        while (!I2C_CheckEvent(IOE_I2C, I2C_EVENT_MASTER_RECEIVER_MODE_SELECTED))
        {
                if (IOE_TimeOut-- == 0) 
    {
      return(IOE_TimeoutUserCallback());
    }
        }

        /* Clear ADDR register by reading SR1 then SR2 register (SR1 has already been read) */
        (void)IOE_I2C->SR2;

        while (nb_car > 1 )
        {
                /* Wait for the byte to be received */
                IOE_TimeOut = TIMEOUT_MAX ;
                
                while(I2C_GetFlagStatus(IOE_I2C, I2C_FLAG_RXNE) == RESET)
                {
                        if((IOE_TimeOut--) == 0) 
      {
                                return(IOE_TimeoutUserCallback());
                        }
                }

                /* Read the byte received from the I2C */
                IOE_BufferRX [index++] = IOE_I2C->DR;
                nb_car--;
        }

        /* Disable Acknowledgment to be ready for another reception */
        I2C_AcknowledgeConfig(IOE_I2C, DISABLE);

        /* Send STOP Condition */
        I2C_GenerateSTOP(IOE_I2C, ENABLE);

        /* Wait to make sure that STOP control bit has been cleared */
        IOE_TimeOut = TIMEOUT_MAX;
        
