QuangHaiNguyen/Oscilloscope_STM32F746/archive/touchgfx/board/ST/STM324x9I-EVAL-5.7/source/vendor/stm324x9i_eval_ioe8.c
        while(IOE_I2C->CR1 & I2C_CR1_STOP)
        {
    if((IOE_TimeOut--) == 0) 
    {
      return(IOE_TimeoutUserCallback());
    }
        }

        /* Wait for the byte to be received */
        IOE_TimeOut = TIMEOUT_MAX ;
        
        while(I2C_GetFlagStatus(IOE_I2C, I2C_FLAG_RXNE) == RESET)
        {
    if((IOE_TimeOut--) == 0) 
    {
      return(IOE_TimeoutUserCallback());
    }
        }

        /* Read the last byte received from the I2C */
        IOE_BufferRX [index] = IOE_I2C->DR;

        /* Re-Enable Acknowledgment to be ready for another reception */
        I2C_AcknowledgeConfig(IOE_I2C, ENABLE);

        /* return a pointer to the IOE_Buffer */
        return IOE_OK;;

}


#ifndef USE_TIMEOUT_USER_CALLBACK 
/**
  * @brief  IOE_TIMEOUT_UserCallback
  * @param  None
  * @retval 0
  */
uint8_t IOE_TimeoutUserCallback(void)
{
  I2C_InitTypeDef I2C_InitStructure;

  I2C_GenerateSTOP(IOE_I2C, ENABLE);
  I2C_SoftwareResetCmd(IOE_I2C, ENABLE);
  I2C_SoftwareResetCmd(IOE_I2C, DISABLE);

  /* CODEC_I2C peripheral configuration */
  I2C_DeInit(I2C1);
  I2C_InitStructure.I2C_Mode = I2C_Mode_I2C;
  I2C_InitStructure.I2C_DutyCycle = I2C_DutyCycle_2;
  I2C_InitStructure.I2C_OwnAddress1 = 0x33;
  I2C_InitStructure.I2C_Ack = I2C_Ack_Enable;
  I2C_InitStructure.I2C_AcknowledgedAddress = I2C_AcknowledgedAddress_7bit;
  I2C_InitStructure.I2C_ClockSpeed = I2C_SPEED;
  
  /* Enable the I2C peripheral */
  I2C_Cmd(IOE_I2C, ENABLE);  
  I2C_Init(IOE_I2C, &I2C_InitStructure);
  
  return 0;
}
#endif /* !USE_TIMEOUT_USER_CALLBACK */

#ifndef USE_Delay
/**
  * @brief  Inserts a delay time.
  * @param  nCount: specifies the delay time length.
  * @retval None
  */
static void delay(__IO uint32_t nCount)
{
  __IO uint32_t index = 0; 
  for(index = (100000 * nCount); index != 0; index--)
  {
  }
}
#endif /* USE_Delay */
/**
  * @}
  */ 

/**
  * @}
  */ 

/**
  * @}
  */ 

/**
  * @}
  */ 

/**
  * @}
  */      
/************************ (C) COPYRIGHT STMicroelectronics *****END OF FILE****/
